public class Main {

    public static void main(String[] args) {
        int ticketPrice = 10_000;
        int milesPrice = 20;
        int bonusMiles = ticketPrice / milesPrice;

        System.out.println( "Количество бонусных миль " + bonusMiles );

        // Объявляете переменные для входных данных и
        // параметров программы: одну для хранения
        // стоимости билета, другую для хранения количества
        // рублей для одной бонусной милли

        // Рассчитываете количество бонусных милль, используя
        // значения заведённых переменных. Ответ сохраняете в
        // новую переменную и выводите на экран
    }
}